# *********************************************************************************************************************
# games_constants.py
# import cogs.helper.constants.games_constants as games_constants
# *********************************************************************************************************************

import os


def blackjack_cards(): return {'Ace of ♠️': 11, 'Ace of ♥️': 11, 'Ace of ♣️': 11, 'Ace of ♦️': 11,
                               '2 of ♠️': 2, '2 of ♥️': 2, '2 of ♣️': 2, '2 of ♦️': 2,
                               '3 of ♠️': 3, '3 of ♥️': 3, '3 of ♣️': 3, '3 of ♦️': 3,
                               '4 of ♠️': 4, '4 of ♥️': 4, '4 of ♣️': 4, '4 of ♦️': 4,
                               '5 of ♠️': 5, '5 of ♥️': 5, '5 of ♣️': 5, '5 of ♦️': 5,
                               '6 of ♠️': 6, '6 of ♥️': 6, '6 of ♣️': 6, '6 of ♦️': 6,
                               '7 of ♠️': 7, '7 of ♥️': 7, '7 of ♣️': 7, '7 of ♦️': 7,
                               '8 of ♠️': 8, '8 of ♥️': 8, '8 of ♣️': 8, '8 of ♦️': 8,
                               '9 of ♠️': 9, '9 of ♥️': 9, '9 of ♣️': 9, '9 of ♦️': 9,
                               '10 of ♠️': 10, '10 of ♥️': 10, '10 of ♣️': 10, '10 of ♦️': 10,
                               'Jack of ♠️': 10, 'Jack of ♥️': 10, 'Jack of ♣️': 10, 'Jack of ♦️': 10,
                               'Queen of ♠️': 10, 'Queen of ♥️': 10, 'Queen of ♣️': 10, 'Queen of ♦️': 10,
                               'King of ♠️': 10, 'King of ♥️': 10, 'King of ♣️': 10, 'King of ♦️': 10}
